# RoofComponents Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RoofComponents Properties
RoofComponents Class See Also
---
The RoofComponents type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| ScaledDepth | The depth of the roof slab. |

# See Also
RoofComponents Class
Autodesk.Revit.DB.IFC Namespace